## Descrição

Esse notebook foi construído para realizar os desafios propostos no final de cada aula do curso **Pandas: conhecendo a biblioteca**

### Desafio 1
Importe o arquivo [**alunos.csv**](https://raw.githubusercontent.com/alura-cursos/pandas-conhecendo-a-biblioteca/main/desafios/alunos.csv) e armazene seu conteúdo em um DataFrame Pandas

In [1]:
import pandas as pd

In [2]:
url_alunos = 'https://raw.githubusercontent.com/alura-cursos/pandas-conhecendo-a-biblioteca/main/desafios/alunos.csv'
alunos = pd.read_csv(url_alunos)

### Desafio 2
Visualize as primeiras 7 linhas do DataFrame e as 5 últimas

In [3]:
alunos.head(7)

    Nome  Idade  Notas  Aprovado
0    Ary     20    7.5      True
1    Ana     18    NaN     False
2  Cátia     27    2.5     False
3  Denis     18    5.0     False
4   Beto     21   10.0      True
5  Bruna     23    NaN     False
6   Dara     21    7.0      True

In [4]:
alunos.tail()

      Nome  Idade  Notas  Aprovado
13   Mirla     25    9.0      True
14   Paulo     37    NaN     False
15  Mylena     29    7.0      True
16   Lucas     33    NaN     False
17   Nadia     34    8.0      True

### Desafio 3
Confira a quantidade de linhas e colunas do DataFrame

In [5]:
alunos.shape

(18, 4)

### Desafio 4
Explore as colunas do DataFrame e analise os tipos dos dados presentes em cada coluna

In [6]:
alunos.columns

Index(['Nome', 'Idade', 'Notas', 'Aprovado'], dtype='object')

In [7]:
alunos['Nome']

0           Ary
1           Ana
2         Cátia
3         Denis
4          Beto
5         Bruna
6          Dara
7        Carlos
8         Alice
9         Vitor
10       Daniel
11         Igor
12    Sthefanie
13        Mirla
14        Paulo
15       Mylena
16        Lucas
17        Nadia
Name: Nome, dtype: object

In [8]:
alunos[['Idade', 'Notas']]

    Idade  Notas
0      20    7.5
1      18    NaN
2      27    2.5
3      18    5.0
4      21   10.0
5      23    NaN
6      21    7.0
7      19    6.0
8      35    5.6
9      28    NaN
10     21    NaN
11     24    4.5
12     26    9.5
13     25    9.0
14     37    NaN
15     29    7.0
16     33    NaN
17     34    8.0

In [9]:
alunos.dtypes

Nome         object
Idade         int64
Notas       float64
Aprovado       bool
dtype: object

### **Desafio 5**
Calcule algumas estatísticas descritivas básicas dos dados do DataFrame (média, desvio padrão, etc)

In [10]:
alunos.describe()

           Idade      Notas
count  18.000000  12.000000
mean   25.500000   6.800000
std     6.070662   2.204953
min    18.000000   2.500000
25%    21.000000   5.450000
50%    24.500000   7.000000
75%    28.750000   8.250000
max    37.000000  10.000000

### Desafio 6
Verifique se a base de dados possui dados nulos e caso tenha, realize o tratamento desses dados nulos

In [11]:
alunos.isnull().sum()

Nome        0
Idade       0
Notas       6
Aprovado    0
dtype: int64

In [12]:
alunos.fillna(0, inplace=True)
alunos

         Nome  Idade  Notas  Aprovado
0         Ary     20    7.5      True
1         Ana     18    0.0     False
2       Cátia     27    2.5     False
3       Denis     18    5.0     False
4        Beto     21   10.0      True
5       Bruna     23    0.0     False
6        Dara     21    7.0      True
7      Carlos     19    6.0      True
8       Alice     35    5.6     False
9       Vitor     28    0.0     False
10     Daniel     21    0.0     False
11       Igor     24    4.5     False
12  Sthefanie     26    9.5      True
13      Mirla     25    9.0      True
14      Paulo     37    0.0     False
15     Mylena     29    7.0      True
16      Lucas     33    0.0     False
17      Nadia     34    8.0      True

### Desafio 7
Os alunos "Alice" e "Carlos", não fazem mais parte da turma. Sendo assim, remova-os da base de dados

In [13]:
# salvando os índices das linhas a serem removidas em uma variável
alunos_a_remover = alunos.query('Nome == "Alice" | Nome == "Carlos"').index

# removendo as linhas referentes aos alunos "Alice" e "Carlos"
alunos.drop(alunos_a_remover, axis=0, inplace=True)
alunos

         Nome  Idade  Notas  Aprovado
0         Ary     20    7.5      True
1         Ana     18    0.0     False
2       Cátia     27    2.5     False
3       Denis     18    5.0     False
4        Beto     21   10.0      True
5       Bruna     23    0.0     False
6        Dara     21    7.0      True
9       Vitor     28    0.0     False
10     Daniel     21    0.0     False
11       Igor     24    4.5     False
12  Sthefanie     26    9.5      True
13      Mirla     25    9.0      True
14      Paulo     37    0.0     False
15     Mylena     29    7.0      True
16      Lucas     33    0.0     False
17      Nadia     34    8.0      True

### Desafio 8
Aplique um filtro que selecione apenas os alunos que foram aprovados

In [14]:
selecao = alunos['Aprovado'] == True
alunos[selecao]

         Nome  Idade  Notas  Aprovado
0         Ary     20    7.5      True
4        Beto     21   10.0      True
6        Dara     21    7.0      True
12  Sthefanie     26    9.5      True
13      Mirla     25    9.0      True
15     Mylena     29    7.0      True
17      Nadia     34    8.0      True

### Desafio 9
Salve o DataFrame que possui apenas os alunos aprovados em um arquivo csv chamado "alunos_aprovados.csv"

In [15]:
alunos_aprovados = alunos[selecao]
alunos_aprovados.to_csv('alunos_aprovados.csv', index=False)

### **Desafio 10**
Ao conferir as notas dos alunos aprovados, notamos que algumas notas estavam incorretas. As alunas que tiraram nota 7.0, na verdade tinham um ponto extra que não foi contabilizado. Sendo assim, substitua as notas 7.0 da base de dados por 8.0. **Dica**: pesquise pelo método **replace**

In [16]:
alunos_aprovados = alunos_aprovados.replace(7.0, 8.0)
alunos_aprovados

         Nome  Idade  Notas  Aprovado
0         Ary     20    7.5      True
4        Beto     21   10.0      True
6        Dara     21    8.0      True
12  Sthefanie     26    9.5      True
13      Mirla     25    9.0      True
15     Mylena     29    8.0      True
17      Nadia     34    8.0      True

### Desafio 11
Os alunos participaram de uma atividade extracurricular e ganharam pontos extras. Esses pontos extras correspondem a 40% da nota atual de cada um deles. Com base nisso, crie uma coluna chamada "Pontos_extras" que contenha os pontos extras de cada aluno, ou seja, 40% da nota atual deles

In [17]:
alunos['Pontos_extras'] = alunos['Notas'].apply(lambda x: x*0.4)
alunos

         Nome  Idade  Notas  Aprovado  Pontos_extras
0         Ary     20    7.5      True            3.0
1         Ana     18    0.0     False            0.0
2       Cátia     27    2.5     False            1.0
3       Denis     18    5.0     False            2.0
4        Beto     21   10.0      True            4.0
5       Bruna     23    0.0     False            0.0
6        Dara     21    7.0      True            2.8
9       Vitor     28    0.0     False            0.0
10     Daniel     21    0.0     False            0.0
11       Igor     24    4.5     False            1.8
12  Sthefanie     26    9.5      True            3.8
13      Mirla     25    9.0      True            3.6
14      Paulo     37    0.0     False            0.0
15     Mylena     29    7.0      True            2.8
16      Lucas     33    0.0     False            0.0
17      Nadia     34    8.0      True            3.2

### Desafio 12
Crie mais uma coluna, chamada "Notas_finais" que possua as notas de cada aluno somada com os pontos extras

In [18]:
alunos['Notas_finais'] = alunos['Notas'] + alunos['Pontos_extras']
alunos

         Nome  Idade  Notas  Aprovado  Pontos_extras  Notas_finais
0         Ary     20    7.5      True            3.0          10.5
1         Ana     18    0.0     False            0.0           0.0
2       Cátia     27    2.5     False            1.0           3.5
3       Denis     18    5.0     False            2.0           7.0
4        Beto     21   10.0      True            4.0          14.0
5       Bruna     23    0.0     False            0.0           0.0
6        Dara     21    7.0      True            2.8           9.8
9       Vitor     28    0.0     False            0.0           0.0
10     Daniel     21    0.0     False            0.0           0.0
11       Igor     24    4.5     False            1.8           6.3
12  Sthefanie     26    9.5      True            3.8          13.3
13      Mirla     25    9.0      True            3.6          12.6
14      Paulo     37    0.0     False            0.0           0.0
15     Mylena     29    7.0      True            2.8           9.8
16      Lucas     33    0.0     False            0.0           0.0
17      Nadia     34    8.0      True            3.2          11.2

### Desafio 13
Como os alunos ganharam pontos extras, alguns que não tinham sido aprovados antes podem ter sido aprovados agora. Com base nisso, crie uma coluna chamada "Aprovado_final" com os seguintes valores:

* True: caso o aluno esteja aprovado (nota final deve ser maior ou igual a 6);
* False: caso o aluno esteja reprovado (nota final deve ser menor que 6).

In [19]:
alunos['Aprovado_final'] = alunos['Notas_finais'].apply(lambda x: True if x >= 6 else False)
alunos

,Nome,Idade,Notas,Aprovado,Pontos_extras,Notas_finais,Aprovado_final
0,Ary,20,7.5,True,3.0,10.5,True
1,Ana,18,0.0,False,0.0,0.0,False
2,Cátia,27,2.5,False,1.0,3.5,False
3,Denis,18,5.0,False,2.0,7.0,True
4,Beto,21,10.0,True,4.0,14.0,True
5,Bruna,23,0.0,False,0.0,0.0,False
6,Dara,21,7.0,True,2.8,9.8,True
9,Vitor,28,0.0,False,0.0,0.0,False
10,Daniel,21,0.0,False,0.0,0.0,False
11,Igor,24,4.5,False,1.8,6.3,True
12,Sthefanie,26,9.5,True,3.8,13.3,True
13,Mirla,25,9.0,True,3.6,12.6,True
14,Paulo,37,0.0,False,0.0,0.0,False
15,Mylena,29,7.0,True,2.8,9.8,True
16,Lucas,33,0.0,False,0.0,0.0,False
17,Nadia,34,8.0,True,3.2,11.2,True

### Desafio 14
Faça uma seleção e verifique quais alunos não tinham sido aprovados anteriormente, mas foram aprovados após a soma dos pontos extras

In [20]:
selecao = (alunos['Aprovado'] == False) & (alunos['Aprovado_final'] == True)
alunos[selecao]

     Nome  Idade  Notas  Aprovado  Pontos_extras  Notas_finais  Aprovado_final
3   Denis     18    5.0     False            2.0           7.0            True
11   Igor     24    4.5     False            1.8           6.3            True